{
    "Principal": {
      "title": "Hey, I'm Khalaf",
      "description": "Full-Stack Developer with 1 year of hands-on experience, focused on building web applications. Proficient in JavaScript, React, Next.js, ASP.NET Core, and Java, committed to delivering optimized solutions that drive real business value."
    },
    "Navigation": {
      "work": "/WORK",
      "writing": "/WRITING",
      "about": "/ABOUT"
    },
    "HomePage": {
      "featuredWork": "Featured Work",
      "viewAllWorks": "View all works"
    },
    "WritingPage": {
      "title": "Writing.",
      "comingSoon": "I don't write much, so enjoy it while it lasts.",
      "back": "BACK"
    },
    "WorksPage": {
      "back": "BACK",
      "allWorks": "ALL WORKS"
    },
    "Project": {
      "year": "Year",
      "duration": "Duration",
      "tags": "Technologies",
      "overview": "Overview",
      "highlights": "Highlights",
      "viewProject": "View Project",
      "back": "BACK",
      "contribution": "CONTRIBUTOIN",
      "techStack": "TECH STACK",
      "links": "LINKS",
      "video": "Application Presentation",
      "videoNotSupported": "Your browser does not support the video tag."
    },
    "AboutPage": {
      "title": "About Me",
      "bio": {
        "part1": "A Internet Systems student at Fatec - RL, currently working as an intern and honing my skills in building solutions.",
        "part2": "As a two-time Data Structure Monitor at my college, I've developed strong mentoring capabilities and technical communication skills. This experience has strengthened my ability to explain complex concepts clearly and collaborate effectively within development teams.",
        "part3": "Beyond my current full-stack expertise, I'm strategically expanding my skills in Data Analysis, with a career trajectory aimed toward Artificial Intelligence and Machine Learning. I'm thinking about directing my career towards this area, with so many technologies it's always good to be prepared for new challenges."
      },
      "downloadResume": "Download Resume",
      "experience": "Experience"
    },
    "Projects": {
      "log-manager": {
        "title": "Log Management System",
        "description": "Developed a comprehensive log management service using ASP.NET Core (.NET 8) with RESTful API architecture.",
        "linkText": "See the post on LinkedIn",
        "contribution_0": "I work as a FullStack Developer, implementing the Backend funcionality using ASP.NET Core (.NET 8) and SQL Server. I also developed the Frontend pagination using HTML and Javascript.",
        "contribution_1": "Learning about C# and ASP.NET Core",
        "contribution_2": "SQL Server Database",
        "video": "Application Presentation",
        "overview": "The Log Service is an academic full-stack project developed in collaboration with 4 classmates. It aims to provide a robust and intuitive solution for centralized log management, enabling users to effectively monitor, analyze, and react to application events. The system focuses on improving operational visibility and ensuring system reliability through proactive alerting and comprehensive data querying capabilities",
        "highlights_0": "Built a responsive Front-End with **HTML, CSS**, and **JavaScript** for intuitive log querying (by date and integration type) and optimized navigation with pagination.",
        "highlights_1": "Engineered an email notification system for critical/high-severity logs, incorporating resilient background services with retry mechanisms to ensure reliable alert delivery."
      },
      "anime-tracker": {
        "title": "Anime Tracker",
        "description": "A web application that helps users track their favorite anime series and discover new shows.",
        "linkText": "No Live Demo for now",
        "contribution_0": "End-to-end Frontend Development with React and TypeScript",
        "contribution_1": "UI/UX Design",
        "contribution_2": "API Integration",
        "overview": "Anime Tracker is a personal project that combines my passion for anime with my web development skills. The app allows users to track their favorite series, receive updates on new episodes, and discover new shows based on their preferences.",
        "highlights_0": "Built a responsive web application using React and TypeScript for a seamless user experience",
        "highlights_1": "Integrated the Jikan API with efficient data fetching strategies, including caching mechanisms to optimize performance and reduce API calls",
        "highlights_2": "Implemented user-focused features including watchlist management, personalized recommendations, and real-time notifications."
      },
      "expense-gov": {
        "title": "Expense Gov",
        "description": "A data visualization tool that transforms complex government spending data into accessible insights for citizens.",
        "linkText": "Live Demo",
        "contribution_0": "Frontend Development",
        "contribution_1": "Data-driven UI/UX Design for complex information visualization",
        "contribution_2": "Interactive Data Visualization implementation with filtering capabilities",
        "overview": "Expense Gov makes government spending data accessible through intuitive visualizations. Built during my web development studies, this project focuses on transforming complex financial data into clear, actionable insights.",
        "highlights_0": "Developed an intuitive interface for exploring government spending data using Next.js and Shadcn",
        "highlights_1": "Designed and implemented interactive data visualization components using Recharts and React, enabling users to explore complex financial data through customizable filters",
        "highlights_2": "Integrated real-time data from the Codante API to ensure accuracy and relevance"
      },
      "dolly-rebrand": {
        "title": "Dolly Rebrand",
        "description": "A conceptual rebranding project exploring modern design solutions for a classic Brazilian soda brand.",
        "linkText": "View Design",
        "contribution_0": "Brand Design",
        "contribution_1": "UI Design",
        "contribution_2": "Comprehensive Design System Creation in Figma",
        "overview": "As part of my design coursework at Fatec Rubens Lara, I explored the challenge of modernizing a beloved Brazilian brand while preserving its core identity and cultural significance.",
        "highlights_0": "Created a modernized visual identity system that respects the brand's heritage",
        "highlights_1": "Designed new packaging concepts focusing on premium aesthetics and shelf appeal",
        "highlights_2": "Developed a cohesive digital design system in Figma for consistent brand expression"
      }
    }
  }
