{
  "Principal": {
    "title": "Khalaf, João.",
    "description": "Desenvolvedor Full-Stack com 1 ano de experiência prática, focado em construir aplicações web. Proficiente em JavaScript, React, Next.js, ASP.NET Core e Java, focado em entregar soluções otimizadas e que gerem valor real para o negócio."
  },
  "Navigation": {
    "work": "/TRABALHOS",
    "writing": "/ARTIGOS",
    "about": "/SOBRE",
    "college": "/FACULDADE"

  },
  "HomePage": {
    "featuredWork": "Trabalhos em Destaque",
    "viewAllWorks": "Ver todos os trabalhos"
  },
  "WritingPage": {
    "title": "Artigos.",
    "comingSoon": "Eu não escrevo muito, então aproveite enquanto dura.",
    "back": "VOLTAR"
  },
  "WorksPage": {
    "back": "VOLTAR",
    "allWorks": "TODOS OS TRABALHOS"
  },
   "CollegePage": {
      "back": "BACK",
      "allWorks": "ALL WORKS"
    },
  "Project": {
    "year": "Ano",
    "duration": "Duração",
    "tags": "Tecnologias",
    "overview": "Visão Geral",
    "highlights": "Destaques",
    "viewProject": "Ver Projeto",
    "back": "VOLTAR",
    "contribution": "CONTRIBUIÇÃO",
    "techStack": "TECNOLOGIAS",
    "links": "LINKS",
    "video": "Apresentação da aplicação",
    "videoNotSupported": "Seu navegador não suporta a tag de vídeo."
  },
  "AboutPage": {
    "title": "Sobre Mim",
    "bio": {
      "part1": "Sou Desenvolvedor FullStack e estudante de Sistemas para Internet na Fatec - RL, atualmente trabalhando como estagiário e aprimorando minhas habilidades na construção de soluções.",
      "part2": "Duas vezes Monitor de Estrutura de Dados na minha faculdade, desenvolvi fortes capacidades de mentoria e habilidades de comunicação técnica. Essa experiência fortaleceu minha capacidade de explicar conceitos complexos claramente e colaborar efetivamente dentro de equipes de desenvolvimento.",
      "part3": "Além da minha experiência atual em full-stack, estou expandindo minhas habilidades em Análise de Dados, com uma trajetória de carreira voltada para Inteligência Artificial e Aprendizado de Máquina. Penso em direcionar minha carreira para esta área, com tantas tecnologias é sempre bom estar preparado para novos desafios."
    },
    "downloadResume": "Baixar Currículo",
    "experience": "Experiência"
  },
  "Projects": {
    "log-manager": {
    "title": "Sistema de Gerenciamento de Logs",
    "description": "Desenvolvi um serviço abrangente de gerenciamento de logs usando ASP.NET Core (.NET 8) com arquitetura RESTful API.",
    "linkText": "Veja a publicação no LinkedIn",
    "contribution_0": "Trabalhei como Desenvolvedor FullStack, implementando a funcionalidade de Backend usando ASP.NET Core (.NET 8) e SQL Server. Também desenvolvi a paginação Frontend usando HTML e Javascript.",
    "contribution_1": "Aprendi sobre C# e ASP.NET Core",
    "contribution_2": "Banco de Dados SQL Server",
    "video": "Apresentação da aplicação",
    "overview": "O Serviço de Logs é um projeto acadêmico full-stack desenvolvido em colaboração com 4 colegas de turma. Seu objetivo é fornecer uma solução robusta e intuitiva para o gerenciamento centralizado de logs, permitindo que os usuários monitorem, analisem e reagirem com eficácia aos eventos da aplicação. O sistema se concentra em melhorar a visibilidade operacional e garantir a confiabilidade do sistema por meio de alertas proativos e recursos abrangentes de consulta de dados",
    "highlights_0": "Construí um Front-End responsivo com HTML, CSS e JavaScript para consulta intuitiva de logs (por data e tipo de integração) e navegação otimizada com paginação.",
    "highlights_1": "Projetei um sistema de notificação por e-mail para logs críticos/de alta gravidade, incorporando serviços de segundo plano resilientes com mecanismos de repetição para garantir a entrega confiável de alertas."
},
    "anime-tracker": {
      "title": "Anime Tracker",
      "description": "Um aplicativo da web que ajuda os usuários a rastrear suas séries de anime favoritas e descobrir novos programas.",
      "linkText": "Nenhuma demonstração ao vivo por enquanto",
      "contribution_0": "Desenvolvimento de front-end de ponta a ponta com React e TypeScript",
      "contribution_1": "Design de UI/UX",
      "contribution_2": "Integração de API",
      "overview": "Anime Tracker é um projeto pessoal que combina minha paixão por anime com minhas habilidades de desenvolvimento web. O aplicativo permite que os usuários rastreiem suas séries favoritas, recebam atualizações sobre novos episódios e descubram novos programas com base em suas preferências.",
      "highlights_0": "Construí um aplicativo da web responsivo usando React e TypeScript para uma experiência de usuário perfeita",
      "highlights_1": "Integrei a API Jikan com estratégias eficientes de busca de dados, incluindo mecanismos de cache para otimizar o desempenho e reduzir chamadas de API",
      "highlights_2": "Implementados recursos focados no usuário, incluindo gerenciamento de lista de observação, recomendações personalizadas e notificações em tempo real."
    },
    "expense-gov": {
      "title": "Expense Gov",
      "description": "Uma ferramenta de visualização de dados que transforma dados complexos de gastos do governo em insights acessíveis para os cidadãos.",
      "linkText": "Demonstração ao vivo",
      "contribution_0": "Desenvolvimento de front-end",
      "contribution_1": "Design de UI/UX orientado a dados para visualização de informações complexas",
      "contribution_2": "Implementação de visualização de dados interativa com recursos de filtragem",
      "overview": "O Expense Gov torna os dados de gastos do governo acessíveis por meio de visualizações intuitivas. Construído durante meus estudos de desenvolvimento web, este projeto se concentra em transformar dados financeiros complexos em insights claros e acionáveis.",
      "highlights_0": "Desenvolveu uma interface intuitiva para explorar dados de gastos do governo usando Next.js e Shadcn",
      "highlights_1": "Projetou e implementou componentes de visualização de dados interativos usando Recharts e React, permitindo que os usuários explorem dados financeiros complexos por meio de filtros personalizáveis",
      "highlights_2": "Dados em tempo real integrados da API Codante para garantir precisão e relevância"
    },
    "dolly-rebrand": {
      "title": "Rebrand Dolly",
      "description": "Um projeto conceitual de rebranding explorando soluções de design modernas para uma marca clássica de refrigerantes brasileira.",
      "linkText": "Ver design",
      "contribution_0": "Design de marca",
      "contribution_1": "Design de IU",
      "contribution_2": "Criação de sistema de design abrangente no Figma",
      "overview": "Como parte do meu curso de design na Fatec Rubens Lara, explorei o desafio de modernizar uma marca brasileira querida, preservando sua identidade central e significado cultural.",
      "highlights_0": "Criei um sistema de identidade visual modernizado que respeita a herança da marca",
      "highlights_1": "Projetei novos conceitos de embalagem com foco em estética premium e apelo de prateleira",
      "highlights_2": "Desenvolvi um sistema de design digital coeso no Figma para uma marca consistente expressão"
    }
  }
}
